# Import Libraries & Data

In [1]:
import pandas as pd
import numpy as np
import os 
# command to import appropriate libraries

In [2]:
df_prods = pd.read_csv(r'C:\Users\boudl\Instacart Basket Analysis\02 Data\Original Data\products.csv', index_col = False)
# command to import products.csv as df_prods

In [3]:
df_ords = pd.read_csv(r'C:\Users\boudl\Instacart Basket Analysis\02 Data\Prepared Data\orders_wrangled.csv', index_col = False)
# command to import orders_wrangledl.csv as df_ords

# Data Consistency Checks

### Products.csv consistency check

In [4]:
df_prods.isnull().sum()
#command to find missing values in df_prods dataframe

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [5]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]
# command to display missing values in product_name column

In [6]:
df_nan
# missing columns values

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [7]:
df_prods.shape
# command to study shape of df_prods dataframe

(49693, 5)

In [8]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]
# command to remove nan values from product_name column

In [9]:
df_prods_clean.shape
# command to study change of df_prods_clean after changes

(49677, 5)

In [10]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]
# command to study any duplicates in df_prods_clean database

In [11]:
df_dups
# study duplicates dataframe

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [12]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()
# define new data frame with clean data, no duplicates

In [13]:
df_prods_clean_no_dups.shape
# shape of dataframe after changes have been made

(49672, 5)

### wrangled_orders.csv consistenct check

In [14]:
df_ords.head()
# command to see first five rows of df_ords database

,Unnamed: 0,order_id,user_id,order_number,day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [15]:
df_ords.describe()
# see structure of df_ords database

,Unnamed: 0,order_id,user_id,order_number,day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Describe function notes of importance:
**Determine what unnamed: 0 column is/importance; visually appears to be duplicate of order_id column
**Day of weeks have min 0 and max 6; interpretation 0 is Sunday and 6 is Saturday
**Order hour of day min 0 and max 2.3 - 24hrs in day is there more information on how to interpret this column?
**Days since order column likely has missing values, the count is off by at lease 0.207

In [16]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)
# command to determine if mix-type data is present

C:\Users\boudl\AppData\Local\Temp\ipykernel_14940\647841936.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\boudl\AppData\Local\Temp\ipykernel_14940\647841936.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\boudl\AppData\Local\Temp\ipykernel_14940\647841936.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\boudl\AppData\Local\Temp\ipykernel_14940\647841936.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\boudl\AppData\Local\Temp\ipykernel_14940\647841936.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\boudl\AppData\Local\Temp\ipykernel_14940\647841936.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\boudl\AppData\Local\Temp\ipykernel_14940\647841936.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)

error message likely due to the deprecation of 'applymap()' funciton; this function is not applicable or compatable with most new pandas libraries

In [17]:
for col in df_ords.columns.tolist():
    weird = (df_ords[col].map(type) != type(df_ords[col].iloc[0]))
    if weird.any():
        print(col + ": mix")
# determine if there is mix-type data within this dataframe

Unnamed: 0: mix
order_id: mix
user_id: mix
order_number: mix
day_of_week: mix
order_hour_of_day: mix
days_since_prior_order: mix

In [18]:
df_ords['Unnamed: 0'] = df_ords['Unnamed: 0'].astype('int64')
# command to change column to integer data type

In [19]:
df_ords['order_id'] = df_ords['order_id'].astype('int64')
# command to change column to integer data type

In [20]:
df_ords['user_id'] = df_ords['user_id'].astype('int64')
# command to change column to integer data type

In [21]:
df_ords['day_of_week'] = df_ords['day_of_week'].astype('int64')
# command to change column to integer data type

In [22]:
df_ords['order_hour_of_day'] = df_ords['order_hour_of_day'].astype('int64')
# command to change column to integer data type

In [23]:
for col in df_ords.columns:
    print(col, ":", df_ords[col].dtype)
# command to see datatypes for each column/confirm changes

Unnamed: 0 : int64
order_id : int64
user_id : int64
order_number : int64
day_of_week : int64
order_hour_of_day : int64
days_since_prior_order : float64

In [24]:
df_ords.shape
# command to see shape of df_ords dataframe

(3421083, 6)

In [24]:
df_ords.isnull().sum()
# command to find missing values within dataframe

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
day_of_week                    0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [25]:
df_ords.drop(columns = ['Unnamed: 0'])
# command to remove unnmamed: 0 column from dataframe

,order_id,user_id,order_number,day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [26]:
df_ords = df_ords.drop(columns = ['Unnamed: 0'])
# command to define database without this column

In [28]:
df_ords['first_order_flag'] = df_ords['days_since_prior_order'].isnull()
# command to create new column for first customer orders where:
true if days_since_prior_order' is null and false otherwise

In [29]:
df_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]
# command to find missing/nan values within dataframe

In [30]:
df_nan
# command to see missing values

,order_id,user_id,order_number,day_of_week,order_hour_of_day,days_since_prior_order,first_order_flag
0,2539329,1,1,2,8,NaN,True
11,2168274,2,1,2,11,NaN,True
26,1374495,3,1,1,14,NaN,True
39,3343014,4,1,6,11,NaN,True
45,2717275,5,1,3,12,NaN,True
...,...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN,True
3420934,3189322,206206,1,3,18,NaN,True
3421002,2166133,206207,1,6,19,NaN,True
3421019,2227043,206208,1,1,15,NaN,True
3421069,3154581,206209,1,3,11,NaN,True

In [32]:
df_dups = df_ords[df_ords.duplicated()]
# command to study any duplicates in df_ords database

In [33]:
df_dups
# command to study duplicates

Empty DataFrame
Columns: [order_id, user_id, order_number, day_of_week, order_hour_of_day, days_since_prior_order, first_order_flag]
Index: []

In [34]:
df_ords.head()
# command to see dataframe with changes where True is no prior customer orders

,order_id,user_id,order_number,day_of_week,order_hour_of_day,days_since_prior_order,first_order_flag
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

# Export Databases

In [35]:
path = r'C:\Users\boudl\Instacart Basket Analysis'
# define path for export

In [36]:
df_ords.to_csv(r'C:\Users\boudl\Instacart Basket Analysis\02 Data\Prepared Data\orders_wrangled_check.csv')
# define the csv file for export

In [37]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled_check.csv'))
# command to export saved dataframe

In [38]:
path = r'C:\Users\boudl\Instacart Basket Analysis'
# define path export

In [39]:
df_prods.to_csv(r'C:\Users\boudl\Instacart Basket Analysis\02 Data\Prepared Data\products_check.csv')
# define the csv file for export

In [40]:
df_prods.to_csv(os.path.join(path, '02 Data' , 'Prepared Data' , 'products_check.csv'))
# command to export saved dataframe